<net name="torch-jit-export" version="11">
<layers>
<layer id="2" name="left_eye_image" type="Parameter" version="opset1">
<data shape="1,3,60,60" element_type="f32"/>
<rt_info>
<attribute name="fused_names" version="0" value="left_eye_image"/>
</rt_info>
<output>
<port id="0" precision="FP32" names="left_eye_image">
<dim>1</dim>
<dim>3</dim>
<dim>60</dim>
<dim>60</dim>
<rt_info>
<attribute name="layout" version="0" layout="[N,C,H,W]"/>
</rt_info>
</port>
</output>
</layer>
<layer id="1" name="right_eye_image" type="Parameter" version="opset1">
<data shape="1,3,60,60" element_type="f32"/>
<rt_info>
<attribute name="fused_names" version="0" value="right_eye_image"/>
</rt_info>
<output>
<port id="0" precision="FP32" names="right_eye_image">
<dim>1</dim>
<dim>3</dim>
<dim>60</dim>
<dim>60</dim>
<rt_info>
<attribute name="layout" version="0" layout="[N,C,H,W]"/>
</rt_info>
</port>
</output>
</layer>
<layer id="0" name="head_pose_angles" type="Parameter" version="opset1">
<data shape="1,3" element_type="f32"/>
<rt_info>
<attribute name="fused_names" version="0" value="head_pose_angles"/>
</rt_info>
<output>
<port id="0" precision="FP32" names="head_pose_angles">
<dim>1</dim>
<dim>3</dim>
<rt_info>
<attribute name="layout" version="0" layout="[N,C]"/>
</rt_info>
</port>
</output>
</layer>
<layer id="3" name="Reshape_1310" type="Const" version="opset1">
<data element_type="f32" shape="1, 3, 1, 1" offset="0" size="12"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>3</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="4" name="Subtract_1313" type="Subtract" version="opset1">
<data auto_broadcast="numpy"/>
<rt_info>
<attribute name="fused_names" version="0" value="92"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>3</dim>
<dim>60</dim>
<dim>60</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>3</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>1</dim>
<dim>3</dim>
<dim>60</dim>
<dim>60</dim>
</port>
</output>
</layer>
<layer id="5" name="Reshape_1304" type="Const" version="opset1">
<data element_type="f32" shape="1, 3, 1, 1" offset="12" size="12"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>3</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="6" name="Multiply_1314" type="Multiply" version="opset1">
<data auto_broadcast="numpy"/>
<rt_info>
<attribute name="fused_names" version="0" value="92"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>3</dim>
<dim>60</dim>
<dim>60</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>3</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>1</dim>
<dim>3</dim>
<dim>60</dim>
<dim>60</dim>
</port>
</output>
</layer>
<layer id="7" name="Reshape_1307" type="Const" version="opset1">
<data element_type="f32" shape="1, 3, 1, 1" offset="24" size="12"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>3</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="8" name="92" type="Add" version="opset1">
<data auto_broadcast="numpy"/>
<rt_info>
<attribute name="fused_names" version="0" value="92"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>3</dim>
<dim>60</dim>
<dim>60</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>3</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32" names="92">
<dim>1</dim>
<dim>3</dim>
<dim>60</dim>
<dim>60</dim>
</port>
</output>
</layer>
<layer id="9" name="8" type="Const" version="opset1">
<data element_type="f32" shape="32, 3, 3, 3" offset="36" size="3456"/>
<rt_info>
<attribute name="fused_names" version="0" value="8"/>
</rt_info>
<output>
<port id="0" precision="FP32" names="8">
<dim>32</dim>
<dim>3</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</output>
</layer>
<layer id="10" name="Convolution_93" type="Convolution" version="opset1">
<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
<rt_info>
<attribute name="fused_names" version="0" value="Convolution_93"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>3</dim>
<dim>60</dim>
<dim>60</dim>
</port>
<port id="1" precision="FP32">
<dim>32</dim>
<dim>3</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>60</dim>
<dim>60</dim>
</port>
</output>
</layer>
<layer id="11" name="Reshape_104" type="Const" version="opset1">
<data element_type="f32" shape="1, 32, 1, 1" offset="3492" size="128"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="12" name="93" type="Add" version="opset1">
<data auto_broadcast="numpy"/>
<rt_info>
<attribute name="fused_names" version="0" value="93, Concat_103, Reshape_104"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>60</dim>
<dim>60</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32" names="93">
<dim>1</dim>
<dim>32</dim>
<dim>60</dim>
<dim>60</dim>
</port>
</output>
</layer>
<layer id="13" name="94" type="ReLU" version="opset1">
<rt_info>
<attribute name="fused_names" version="0" value="94"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>60</dim>
<dim>60</dim>
</port>
</input>
<output>
<port id="1" precision="FP32" names="94">
<dim>1</dim>
<dim>32</dim>
<dim>60</dim>
<dim>60</dim>
</port>
</output>
</layer>
<layer id="14" name="Reshape_1333" type="Const" version="opset1">
<data element_type="f32" shape="1, 32, 1, 1" offset="3620" size="128"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="15" name="Subtract_1336" type="Subtract" version="opset1">
<data auto_broadcast="numpy"/>
<rt_info>
<attribute name="fused_names" version="0" value="95"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>60</dim>
<dim>60</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>60</dim>
<dim>60</dim>
</port>
</output>
</layer>
<layer id="16" name="Reshape_1327" type="Const" version="opset1">
<data element_type="f32" shape="1, 32, 1, 1" offset="3748" size="128"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="17" name="Multiply_1337" type="Multiply" version="opset1">
<data auto_broadcast="numpy"/>
<rt_info>
<attribute name="fused_names" version="0" value="95"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>60</dim>
<dim>60</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>60</dim>
<dim>60</dim>
</port>
</output>
</layer>
<layer id="18" name="Reshape_1330" type="Const" version="opset1">
<data element_type="f32" shape="1, 32, 1, 1" offset="3876" size="128"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="19" name="95" type="Add" version="opset1">
<data auto_broadcast="numpy"/>
<rt_info>
<attribute name="fused_names" version="0" value="95"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>60</dim>
<dim>60</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32" names="95">
<dim>1</dim>
<dim>32</dim>
<dim>60</dim>
<dim>60</dim>
</port>
</output>
</layer>
<layer id="20" name="15" type="Const" version="opset1">
<data element_type="f32" shape="16, 32, 3, 3" offset="4004" size="18432"/>
<rt_info>
<attribute name="fused_names" version="0" value="15"/>
</rt_info>
<output>
<port id="0" precision="FP32" names="15">
<dim>16</dim>
<dim>32</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</output>
</layer>
<layer id="21" name="Convolution_110" type="Convolution" version="opset1">
<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
<rt_info>
<attribute name="fused_names" version="0" value="Convolution_110"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>60</dim>
<dim>60</dim>
</port>
<port id="1" precision="FP32">
<dim>16</dim>
<dim>32</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>1</dim>
<dim>16</dim>
<dim>30</dim>
<dim>30</dim>
</port>
</output>
</layer>
<layer id="22" name="Reshape_121" type="Const" version="opset1">
<data element_type="f32" shape="1, 16, 1, 1" offset="22436" size="64"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>16</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="23" name="96" type="Add" version="opset1">
<data auto_broadcast="numpy"/>
<rt_info>
<attribute name="fused_names" version="0" value="96, Concat_120, Reshape_121"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>16</dim>
<dim>30</dim>
<dim>30</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>16</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32" names="96">
<dim>1</dim>
<dim>16</dim>
<dim>30</dim>
<dim>30</dim>
</port>
</output>
</layer>
<layer id="24" name="17" type="Const" version="opset1">
<data element_type="f32" shape="64, 16, 3, 3" offset="22500" size="36864"/>
<rt_info>
<attribute name="fused_names" version="0" value="17"/>
</rt_info>
<output>
<port id="0" precision="FP32" names="17">
<dim>64</dim>
<dim>16</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</output>
</layer>
<layer id="25" name="Convolution_125" type="Convolution" version="opset1">
<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
<rt_info>
<attribute name="fused_names" version="0" value="Convolution_125"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>16</dim>
<dim>30</dim>
<dim>30</dim>
</port>
<port id="1" precision="FP32">
<dim>64</dim>
<dim>16</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>30</dim>
<dim>30</dim>
</port>
</output>
</layer>
<layer id="26" name="Reshape_136" type="Const" version="opset1">
<data element_type="f32" shape="1, 64, 1, 1" offset="59364" size="256"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="27" name="97" type="Add" version="opset1">
<data auto_broadcast="numpy"/>
<rt_info>
<attribute name="fused_names" version="0" value="97, Concat_135, Reshape_136"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>30</dim>
<dim>30</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32" names="97">
<dim>1</dim>
<dim>64</dim>
<dim>30</dim>
<dim>30</dim>
</port>
</output>
</layer>
<layer id="28" name="98" type="ReLU" version="opset1">
<rt_info>
<attribute name="fused_names" version="0" value="98"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>30</dim>
<dim>30</dim>
</port>
</input>
<output>
<port id="1" precision="FP32" names="98">
<dim>1</dim>
<dim>64</dim>
<dim>30</dim>
<dim>30</dim>
</port>
</output>
</layer>
<layer id="29" name="Reshape_1356" type="Const" version="opset1">
<data element_type="f32" shape="1, 64, 1, 1" offset="59620" size="256"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="30" name="Subtract_1359" type="Subtract" version="opset1">
<data auto_broadcast="numpy"/>
<rt_info>
<attribute name="fused_names" version="0" value="99"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>30</dim>
<dim>30</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>30</dim>
<dim>30</dim>
</port>
</output>
</layer>
<layer id="31" name="Reshape_1350" type="Const" version="opset1">
<data element_type="f32" shape="1, 64, 1, 1" offset="59876" size="256"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="32" name="Multiply_1360" type="Multiply" version="opset1">
<data auto_broadcast="numpy"/>
<rt_info>
<attribute name="fused_names" version="0" value="99"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>30</dim>
<dim>30</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>30</dim>
<dim>30</dim>
</port>
</output>
</layer>
<layer id="33" name="Reshape_1353" type="Const" version="opset1">
<data element_type="f32" shape="1, 64, 1, 1" offset="60132" size="256"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="34" name="99" type="Add" version="opset1">
<data auto_broadcast="numpy"/>
<rt_info>
<attribute name="fused_names" version="0" value="99"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>30</dim>
<dim>30</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32" names="99">
<dim>1</dim>
<dim>64</dim>
<dim>30</dim>
<dim>30</dim>
</port>
</output>
</layer>
<layer id="35" name="24" type="Const" version="opset1">
<data element_type="f32" shape="32, 64, 3, 3" offset="60388" size="73728"/>
<rt_info>
<attribute name="fused_names" version="0" value="24"/>
</rt_info>
<output>
<port id="0" precision="FP32" names="24">
<dim>32</dim>
<dim>64</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</output>
</layer>
<layer id="36" name="Convolution_142" type="Convolution" version="opset1">
<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
<rt_info>
<attribute name="fused_names" version="0" value="Convolution_142"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>30</dim>
<dim>30</dim>
</port>
<port id="1" precision="FP32">
<dim>32</dim>
<dim>64</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>15</dim>
<dim>15</dim>
</port>
</output>
</layer>
<layer id="37" name="Reshape_153" type="Const" version="opset1">
<data element_type="f32" shape="1, 32, 1, 1" offset="134116" size="128"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="38" name="100" type="Add" version="opset1">
<data auto_broadcast="numpy"/>
<rt_info>
<attribute name="fused_names" version="0" value="100, Concat_152, Reshape_153"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>15</dim>
<dim>15</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32" names="100">
<dim>1</dim>
<dim>32</dim>
<dim>15</dim>
<dim>15</dim>
</port>
</output>
</layer>
<layer id="39" name="Reshape_1379" type="Const" version="opset1">
<data element_type="f32" shape="1, 3, 1, 1" offset="134244" size="12"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>3</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="40" name="Subtract_1382" type="Subtract" version="opset1">
<data auto_broadcast="numpy"/>
<rt_info>
<attribute name="fused_names" version="0" value="101"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>3</dim>
<dim>60</dim>
<dim>60</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>3</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>1</dim>
<dim>3</dim>
<dim>60</dim>
<dim>60</dim>
</port>
</output>
</layer>
<layer id="41" name="Reshape_1373" type="Const" version="opset1">
<data element_type="f32" shape="1, 3, 1, 1" offset="134256" size="12"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>3</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="42" name="Multiply_1383" type="Multiply" version="opset1">
<data auto_broadcast="numpy"/>
<rt_info>
<attribute name="fused_names" version="0" value="101"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>3</dim>
<dim>60</dim>
<dim>60</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>3</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>1</dim>
<dim>3</dim>
<dim>60</dim>
<dim>60</dim>
</port>
</output>
</layer>
<layer id="43" name="Reshape_1376" type="Const" version="opset1">
<data element_type="f32" shape="1, 3, 1, 1" offset="134268" size="12"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>3</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="44" name="101" type="Add" version="opset1">
<data auto_broadcast="numpy"/>
<rt_info>
<attribute name="fused_names" version="0" value="101"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>3</dim>
<dim>60</dim>
<dim>60</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>3</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32" names="101">
<dim>1</dim>
<dim>3</dim>
<dim>60</dim>
<dim>60</dim>
</port>
</output>
</layer>
<layer id="45" name="31" type="Const" version="opset1">
<data element_type="f32" shape="32, 3, 3, 3" offset="134280" size="3456"/>
<rt_info>
<attribute name="fused_names" version="0" value="31"/>
</rt_info>
<output>
<port id="0" precision="FP32" names="31">
<dim>32</dim>
<dim>3</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</output>
</layer>
<layer id="46" name="Convolution_158" type="Convolution" version="opset1">
<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
<rt_info>
<attribute name="fused_names" version="0" value="Convolution_158"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>3</dim>
<dim>60</dim>
<dim>60</dim>
</port>
<port id="1" precision="FP32">
<dim>32</dim>
<dim>3</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>60</dim>
<dim>60</dim>
</port>
</output>
</layer>
<layer id="47" name="Reshape_169" type="Const" version="opset1">
<data element_type="f32" shape="1, 32, 1, 1" offset="137736" size="128"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="48" name="102" type="Add" version="opset1">
<data auto_broadcast="numpy"/>
<rt_info>
<attribute name="fused_names" version="0" value="102, Concat_168, Reshape_169"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>60</dim>
<dim>60</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32" names="102">
<dim>1</dim>
<dim>32</dim>
<dim>60</dim>
<dim>60</dim>
</port>
</output>
</layer>
<layer id="49" name="103" type="ReLU" version="opset1">
<rt_info>
<attribute name="fused_names" version="0" value="103"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>60</dim>
<dim>60</dim>
</port>
</input>
<output>
<port id="1" precision="FP32" names="103">
<dim>1</dim>
<dim>32</dim>
<dim>60</dim>
<dim>60</dim>
</port>
</output>
</layer>
<layer id="50" name="Reshape_1402" type="Const" version="opset1">
<data element_type="f32" shape="1, 32, 1, 1" offset="137864" size="128"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="51" name="Subtract_1405" type="Subtract" version="opset1">
<data auto_broadcast="numpy"/>
<rt_info>
<attribute name="fused_names" version="0" value="104"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>60</dim>
<dim>60</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>60</dim>
<dim>60</dim>
</port>
</output>
</layer>
<layer id="52" name="Reshape_1396" type="Const" version="opset1">
<data element_type="f32" shape="1, 32, 1, 1" offset="137992" size="128"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="53" name="Multiply_1406" type="Multiply" version="opset1">
<data auto_broadcast="numpy"/>
<rt_info>
<attribute name="fused_names" version="0" value="104"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>60</dim>
<dim>60</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>60</dim>
<dim>60</dim>
</port>
</output>
</layer>
<layer id="54" name="Reshape_1399" type="Const" version="opset1">
<data element_type="f32" shape="1, 32, 1, 1" offset="138120" size="128"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="55" name="104" type="Add" version="opset1">
<data auto_broadcast="numpy"/>
<rt_info>
<attribute name="fused_names" version="0" value="104"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>60</dim>
<dim>60</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32" names="104">
<dim>1</dim>
<dim>32</dim>
<dim>60</dim>
<dim>60</dim>
</port>
</output>
</layer>
<layer id="56" name="38" type="Const" version="opset1">
<data element_type="f32" shape="16, 32, 3, 3" offset="138248" size="18432"/>
<rt_info>
<attribute name="fused_names" version="0" value="38"/>
</rt_info>
<output>
<port id="0" precision="FP32" names="38">
<dim>16</dim>
<dim>32</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</output>
</layer>
<layer id="57" name="Convolution_175" type="Convolution" version="opset1">
<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
<rt_info>
<attribute name="fused_names" version="0" value="Convolution_175"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>60</dim>
<dim>60</dim>
</port>
<port id="1" precision="FP32">
<dim>16</dim>
<dim>32</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>1</dim>
<dim>16</dim>
<dim>30</dim>
<dim>30</dim>
</port>
</output>
</layer>
<layer id="58" name="Reshape_186" type="Const" version="opset1">
<data element_type="f32" shape="1, 16, 1, 1" offset="156680" size="64"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>16</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="59" name="105" type="Add" version="opset1">
<data auto_broadcast="numpy"/>
<rt_info>
<attribute name="fused_names" version="0" value="105, Concat_185, Reshape_186"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>16</dim>
<dim>30</dim>
<dim>30</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>16</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32" names="105">
<dim>1</dim>
<dim>16</dim>
<dim>30</dim>
<dim>30</dim>
</port>
</output>
</layer>
<layer id="60" name="40" type="Const" version="opset1">
<data element_type="f32" shape="64, 16, 3, 3" offset="156744" size="36864"/>
<rt_info>
<attribute name="fused_names" version="0" value="40"/>
</rt_info>
<output>
<port id="0" precision="FP32" names="40">
<dim>64</dim>
<dim>16</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</output>
</layer>
<layer id="61" name="Convolution_190" type="Convolution" version="opset1">
<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
<rt_info>
<attribute name="fused_names" version="0" value="Convolution_190"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>16</dim>
<dim>30</dim>
<dim>30</dim>
</port>
<port id="1" precision="FP32">
<dim>64</dim>
<dim>16</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>30</dim>
<dim>30</dim>
</port>
</output>
</layer>
<layer id="62" name="Reshape_201" type="Const" version="opset1">
<data element_type="f32" shape="1, 64, 1, 1" offset="193608" size="256"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="63" name="106" type="Add" version="opset1">
<data auto_broadcast="numpy"/>
<rt_info>
<attribute name="fused_names" version="0" value="106, Concat_200, Reshape_201"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>30</dim>
<dim>30</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32" names="106">
<dim>1</dim>
<dim>64</dim>
<dim>30</dim>
<dim>30</dim>
</port>
</output>
</layer>
<layer id="64" name="107" type="ReLU" version="opset1">
<rt_info>
<attribute name="fused_names" version="0" value="107"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>30</dim>
<dim>30</dim>
</port>
</input>
<output>
<port id="1" precision="FP32" names="107">
<dim>1</dim>
<dim>64</dim>
<dim>30</dim>
<dim>30</dim>
</port>
</output>
</layer>
<layer id="65" name="Reshape_1425" type="Const" version="opset1">
<data element_type="f32" shape="1, 64, 1, 1" offset="193864" size="256"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="66" name="Subtract_1428" type="Subtract" version="opset1">
<data auto_broadcast="numpy"/>
<rt_info>
<attribute name="fused_names" version="0" value="108"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>30</dim>
<dim>30</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>30</dim>
<dim>30</dim>
</port>
</output>
</layer>
<layer id="67" name="Reshape_1419" type="Const" version="opset1">
<data element_type="f32" shape="1, 64, 1, 1" offset="194120" size="256"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="68" name="Multiply_1429" type="Multiply" version="opset1">
<data auto_broadcast="numpy"/>
<rt_info>
<attribute name="fused_names" version="0" value="108"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>30</dim>
<dim>30</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>30</dim>
<dim>30</dim>
</port>
</output>
</layer>
<layer id="69" name="Reshape_1422" type="Const" version="opset1">
<data element_type="f32" shape="1, 64, 1, 1" offset="194376" size="256"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="70" name="108" type="Add" version="opset1">
<data auto_broadcast="numpy"/>
<rt_info>
<attribute name="fused_names" version="0" value="108"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>30</dim>
<dim>30</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32" names="108">
<dim>1</dim>
<dim>64</dim>
<dim>30</dim>
<dim>30</dim>
</port>
</output>
</layer>
<layer id="71" name="47" type="Const" version="opset1">
<data element_type="f32" shape="32, 64, 3, 3" offset="194632" size="73728"/>
<rt_info>
<attribute name="fused_names" version="0" value="47"/>
</rt_info>
<output>
<port id="0" precision="FP32" names="47">
<dim>32</dim>
<dim>64</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</output>
</layer>
<layer id="72" name="Convolution_207" type="Convolution" version="opset1">
<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
<rt_info>
<attribute name="fused_names" version="0" value="Convolution_207"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>30</dim>
<dim>30</dim>
</port>
<port id="1" precision="FP32">
<dim>32</dim>
<dim>64</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>15</dim>
<dim>15</dim>
</port>
</output>
</layer>
<layer id="73" name="Reshape_218" type="Const" version="opset1">
<data element_type="f32" shape="1, 32, 1, 1" offset="268360" size="128"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="74" name="109" type="Add" version="opset1">
<data auto_broadcast="numpy"/>
<rt_info>
<attribute name="fused_names" version="0" value="109, Concat_217, Reshape_218"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>15</dim>
<dim>15</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32" names="109">
<dim>1</dim>
<dim>32</dim>
<dim>15</dim>
<dim>15</dim>
</port>
</output>
</layer>
<layer id="75" name="110" type="Concat" version="opset1">
<data axis="1"/>
<rt_info>
<attribute name="fused_names" version="0" value="110"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>15</dim>
<dim>15</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>32</dim>
<dim>15</dim>
<dim>15</dim>
</port>
</input>
<output>
<port id="2" precision="FP32" names="110">
<dim>1</dim>
<dim>64</dim>
<dim>15</dim>
<dim>15</dim>
</port>
</output>
</layer>
<layer id="76" name="49" type="Const" version="opset1">
<data element_type="f32" shape="128, 64, 3, 3" offset="268488" size="294912"/>
<rt_info>
<attribute name="fused_names" version="0" value="49"/>
</rt_info>
<output>
<port id="0" precision="FP32" names="49">
<dim>128</dim>
<dim>64</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</output>
</layer>
<layer id="77" name="Convolution_223" type="Convolution" version="opset1">
<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
<rt_info>
<attribute name="fused_names" version="0" value="Convolution_223"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>15</dim>
<dim>15</dim>
</port>
<port id="1" precision="FP32">
<dim>128</dim>
<dim>64</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>15</dim>
<dim>15</dim>
</port>
</output>
</layer>
<layer id="78" name="Reshape_234" type="Const" version="opset1">
<data element_type="f32" shape="1, 128, 1, 1" offset="563400" size="512"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="79" name="111" type="Add" version="opset1">
<data auto_broadcast="numpy"/>
<rt_info>
<attribute name="fused_names" version="0" value="111, Concat_233, Reshape_234"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>15</dim>
<dim>15</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32" names="111">
<dim>1</dim>
<dim>128</dim>
<dim>15</dim>
<dim>15</dim>
</port>
</output>
</layer>
<layer id="80" name="112" type="ReLU" version="opset1">
<rt_info>
<attribute name="fused_names" version="0" value="112"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>15</dim>
<dim>15</dim>
</port>
</input>
<output>
<port id="1" precision="FP32" names="112">
<dim>1</dim>
<dim>128</dim>
<dim>15</dim>
<dim>15</dim>
</port>
</output>
</layer>
<layer id="81" name="Reshape_1448" type="Const" version="opset1">
<data element_type="f32" shape="1, 128, 1, 1" offset="563912" size="512"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="82" name="Subtract_1451" type="Subtract" version="opset1">
<data auto_broadcast="numpy"/>
<rt_info>
<attribute name="fused_names" version="0" value="113"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>15</dim>
<dim>15</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>15</dim>
<dim>15</dim>
</port>
</output>
</layer>
<layer id="83" name="Reshape_1442" type="Const" version="opset1">
<data element_type="f32" shape="1, 128, 1, 1" offset="564424" size="512"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="84" name="Multiply_1452" type="Multiply" version="opset1">
<data auto_broadcast="numpy"/>
<rt_info>
<attribute name="fused_names" version="0" value="113"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>15</dim>
<dim>15</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>15</dim>
<dim>15</dim>
</port>
</output>
</layer>
<layer id="85" name="Reshape_1445" type="Const" version="opset1">
<data element_type="f32" shape="1, 128, 1, 1" offset="564936" size="512"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="86" name="113" type="Add" version="opset1">
<data auto_broadcast="numpy"/>
<rt_info>
<attribute name="fused_names" version="0" value="113"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>15</dim>
<dim>15</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32" names="113">
<dim>1</dim>
<dim>128</dim>
<dim>15</dim>
<dim>15</dim>
</port>
</output>
</layer>
<layer id="87" name="56" type="Const" version="opset1">
<data element_type="f32" shape="64, 128, 3, 3" offset="565448" size="294912"/>
<rt_info>
<attribute name="fused_names" version="0" value="56"/>
</rt_info>
<output>
<port id="0" precision="FP32" names="56">
<dim>64</dim>
<dim>128</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</output>
</layer>
<layer id="88" name="Convolution_240" type="Convolution" version="opset1">
<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
<rt_info>
<attribute name="fused_names" version="0" value="Convolution_240"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>15</dim>
<dim>15</dim>
</port>
<port id="1" precision="FP32">
<dim>64</dim>
<dim>128</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>8</dim>
<dim>8</dim>
</port>
</output>
</layer>
<layer id="89" name="Reshape_251" type="Const" version="opset1">
<data element_type="f32" shape="1, 64, 1, 1" offset="860360" size="256"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="90" name="114" type="Add" version="opset1">
<data auto_broadcast="numpy"/>
<rt_info>
<attribute name="fused_names" version="0" value="114, Concat_250, Reshape_251"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>8</dim>
<dim>8</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32" names="114">
<dim>1</dim>
<dim>64</dim>
<dim>8</dim>
<dim>8</dim>
</port>
</output>
</layer>
<layer id="91" name="58" type="Const" version="opset1">
<data element_type="f32" shape="128, 64, 3, 3" offset="860616" size="294912"/>
<rt_info>
<attribute name="fused_names" version="0" value="58"/>
</rt_info>
<output>
<port id="0" precision="FP32" names="58">
<dim>128</dim>
<dim>64</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</output>
</layer>
<layer id="92" name="Convolution_255" type="Convolution" version="opset1">
<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
<rt_info>
<attribute name="fused_names" version="0" value="Convolution_255"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>8</dim>
<dim>8</dim>
</port>
<port id="1" precision="FP32">
<dim>128</dim>
<dim>64</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>8</dim>
<dim>8</dim>
</port>
</output>
</layer>
<layer id="93" name="Reshape_266" type="Const" version="opset1">
<data element_type="f32" shape="1, 128, 1, 1" offset="1155528" size="512"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="94" name="115" type="Add" version="opset1">
<data auto_broadcast="numpy"/>
<rt_info>
<attribute name="fused_names" version="0" value="115, Concat_265, Reshape_266"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>8</dim>
<dim>8</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32" names="115">
<dim>1</dim>
<dim>128</dim>
<dim>8</dim>
<dim>8</dim>
</port>
</output>
</layer>
<layer id="95" name="116" type="ReLU" version="opset1">
<rt_info>
<attribute name="fused_names" version="0" value="116"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>8</dim>
<dim>8</dim>
</port>
</input>
<output>
<port id="1" precision="FP32" names="116">
<dim>1</dim>
<dim>128</dim>
<dim>8</dim>
<dim>8</dim>
</port>
</output>
</layer>
<layer id="96" name="Reshape_1471" type="Const" version="opset1">
<data element_type="f32" shape="1, 128, 1, 1" offset="1156040" size="512"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="97" name="Subtract_1474" type="Subtract" version="opset1">
<data auto_broadcast="numpy"/>
<rt_info>
<attribute name="fused_names" version="0" value="117"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>8</dim>
<dim>8</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>8</dim>
<dim>8</dim>
</port>
</output>
</layer>
<layer id="98" name="Reshape_1465" type="Const" version="opset1">
<data element_type="f32" shape="1, 128, 1, 1" offset="1156552" size="512"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="99" name="Multiply_1475" type="Multiply" version="opset1">
<data auto_broadcast="numpy"/>
<rt_info>
<attribute name="fused_names" version="0" value="117"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>8</dim>
<dim>8</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>8</dim>
<dim>8</dim>
</port>
</output>
</layer>
<layer id="100" name="Reshape_1468" type="Const" version="opset1">
<data element_type="f32" shape="1, 128, 1, 1" offset="1157064" size="512"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="101" name="117" type="Add" version="opset1">
<data auto_broadcast="numpy"/>
<rt_info>
<attribute name="fused_names" version="0" value="117"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>8</dim>
<dim>8</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32" names="117">
<dim>1</dim>
<dim>128</dim>
<dim>8</dim>
<dim>8</dim>
</port>
</output>
</layer>
<layer id="102" name="65" type="Const" version="opset1">
<data element_type="f32" shape="64, 128, 3, 3" offset="1157576" size="294912"/>
<rt_info>
<attribute name="fused_names" version="0" value="65"/>
</rt_info>
<output>
<port id="0" precision="FP32" names="65">
<dim>64</dim>
<dim>128</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</output>
</layer>
<layer id="103" name="Convolution_272" type="Convolution" version="opset1">
<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
<rt_info>
<attribute name="fused_names" version="0" value="Convolution_272"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>128</dim>
<dim>8</dim>
<dim>8</dim>
</port>
<port id="1" precision="FP32">
<dim>64</dim>
<dim>128</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</output>
</layer>
<layer id="104" name="Reshape_283" type="Const" version="opset1">
<data element_type="f32" shape="1, 64, 1, 1" offset="1452488" size="256"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="105" name="118" type="Add" version="opset1">
<data auto_broadcast="numpy"/>
<rt_info>
<attribute name="fused_names" version="0" value="118, Concat_282, Reshape_283"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>3</dim>
<dim>3</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32" names="118">
<dim>1</dim>
<dim>64</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</output>
</layer>
<layer id="106" name="67" type="Const" version="opset1">
<data element_type="f32" shape="256, 64, 3, 3" offset="1452744" size="589824"/>
<rt_info>
<attribute name="fused_names" version="0" value="67"/>
</rt_info>
<output>
<port id="0" precision="FP32" names="67">
<dim>256</dim>
<dim>64</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</output>
</layer>
<layer id="107" name="Convolution_287" type="Convolution" version="opset1">
<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
<rt_info>
<attribute name="fused_names" version="0" value="Convolution_287"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>64</dim>
<dim>3</dim>
<dim>3</dim>
</port>
<port id="1" precision="FP32">
<dim>256</dim>
<dim>64</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>1</dim>
<dim>256</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</output>
</layer>
<layer id="108" name="Reshape_298" type="Const" version="opset1">
<data element_type="f32" shape="1, 256, 1, 1" offset="2042568" size="1024"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>256</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="109" name="119" type="Add" version="opset1">
<data auto_broadcast="numpy"/>
<rt_info>
<attribute name="fused_names" version="0" value="119, Concat_297, Reshape_298"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>256</dim>
<dim>3</dim>
<dim>3</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>256</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32" names="119">
<dim>1</dim>
<dim>256</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</output>
</layer>
<layer id="110" name="120" type="ReLU" version="opset1">
<rt_info>
<attribute name="fused_names" version="0" value="120"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>256</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</input>
<output>
<port id="1" precision="FP32" names="120">
<dim>1</dim>
<dim>256</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</output>
</layer>
<layer id="111" name="Reshape_1494" type="Const" version="opset1">
<data element_type="f32" shape="1, 256, 1, 1" offset="2043592" size="1024"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>256</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="112" name="Subtract_1497" type="Subtract" version="opset1">
<data auto_broadcast="numpy"/>
<rt_info>
<attribute name="fused_names" version="0" value="121"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>256</dim>
<dim>3</dim>
<dim>3</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>256</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>1</dim>
<dim>256</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</output>
</layer>
<layer id="113" name="Reshape_1488" type="Const" version="opset1">
<data element_type="f32" shape="1, 256, 1, 1" offset="2044616" size="1024"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>256</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="114" name="Multiply_1498" type="Multiply" version="opset1">
<data auto_broadcast="numpy"/>
<rt_info>
<attribute name="fused_names" version="0" value="121"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>256</dim>
<dim>3</dim>
<dim>3</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>256</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>1</dim>
<dim>256</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</output>
</layer>
<layer id="115" name="Reshape_1491" type="Const" version="opset1">
<data element_type="f32" shape="1, 256, 1, 1" offset="2045640" size="1024"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>256</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="116" name="121" type="Add" version="opset1">
<data auto_broadcast="numpy"/>
<rt_info>
<attribute name="fused_names" version="0" value="121"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>256</dim>
<dim>3</dim>
<dim>3</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>256</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32" names="121">
<dim>1</dim>
<dim>256</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</output>
</layer>
<layer id="117" name="74" type="Const" version="opset1">
<data element_type="f32" shape="512, 256, 3, 3" offset="2046664" size="4718592"/>
<rt_info>
<attribute name="fused_names" version="0" value="74"/>
</rt_info>
<output>
<port id="0" precision="FP32" names="74">
<dim>512</dim>
<dim>256</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</output>
</layer>
<layer id="118" name="Convolution_304" type="Convolution" version="opset1">
<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
<rt_info>
<attribute name="fused_names" version="0" value="Convolution_304"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>256</dim>
<dim>3</dim>
<dim>3</dim>
</port>
<port id="1" precision="FP32">
<dim>512</dim>
<dim>256</dim>
<dim>3</dim>
<dim>3</dim>
</port>
</input>
<output>
<port id="2" precision="FP32">
<dim>1</dim>
<dim>512</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="119" name="Reshape_315" type="Const" version="opset1">
<data element_type="f32" shape="1, 512, 1, 1" offset="6765256" size="2048"/>
<output>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>512</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="120" name="122" type="Add" version="opset1">
<data auto_broadcast="numpy"/>
<rt_info>
<attribute name="fused_names" version="0" value="122, Concat_314, Reshape_315"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>512</dim>
<dim>1</dim>
<dim>1</dim>
</port>
<port id="1" precision="FP32">
<dim>1</dim>
<dim>512</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</input>
<output>
<port id="2" precision="FP32" names="122">
<dim>1</dim>
<dim>512</dim>
<dim>1</dim>
<dim>1</dim>
</port>
</output>
</layer>
<layer id="121" name="129" type="Const" version="opset1">
<data element_type="i64" shape="2" offset="6767304" size="16"/>
<rt_info>
<attribute name="fused_names" version="0" value="128, 129"/>
</rt_info>
<output>
<port id="0" precision="I64">
<dim>2</dim>
</port>
</output>
</layer>
<layer id="122" name="130" type="Reshape" version="opset1">
<data special_zero="true"/>
<rt_info>
<attribute name="fused_names" version="0" value="130"/>
</rt_info>
<input>
<port id="0" precision="FP32">
<dim>1</dim>
<dim>512</dim>
<dim>1</dim>
<dim>1</dim>
</port>
<port id="1" precision="I64">
<dim>2</dim>
</port>
</input>
<output>
<port id="2" precision="FP32" names="130">
<dim>1</dim>
<dim>512</dim>
</port>
</output>
</layer>
<layer id="123" name="137" type="Const" version="opset1">
<data element_type="i64" shape="2" offset="6767304" size="16"/>
<rt_info>
<attribute name="fused_names" version="0" value="136, 137"/>
</rt_info>
<output>
<port id="0" precision="I64">
<dim>2</dim>
</port>
</output>
</layer>
<layer id="124" name="138" type="Reshape" version="opset1">
<data special_zero="true"/>
<rt_info>
